posts/2020-lanqiao-Provincial-Simulation.org
#+TITLE:       2020年蓝桥杯省模拟赛题解
#+DATE:        <2020-04-20 00:00>
#+FILETAGS:    蓝桥杯 算法 题解
#+OPTIONS:     H:3 num:nil toc:nil \n:nil ::t |:t ^:nil -:nil f:t *:t <:t
#+DESCRIPTION: 2020年蓝桥杯省模拟赛题目解析

* 题解
** 第一题
*** 题目
在计算机存储中，12.5MB 是多少字节？
*** 解析
1MB=1024KB，1KB=1024B
*** 答案
13107200

** 第二题
*** 题目
由 1 对括号，可以组成一种合法括号序列：()。

由 2 对括号，可以组成两种合法括号序列：()()、(())。

由 4 对括号组成的合法括号序列一共有多少种？
*** 解析
- 直接查找卡特兰数
- 用栈模拟，左括号相当于入栈，右括号相当于出栈，这样将题目转换成了统计出入栈序列总数了。
*** 答案
14

** 第三题
*** 题目
将 LANQIAO 中的字母重新排列，可以得到不同的单词，LANQIAO、AAILNOQ 等，注意这 7 个字母都要被用上，单词不一定有具体的英文意义。请问，总共能排列如多少个不同的单词。
*** 解析
- 有两个字母相同，其余都是不同字母，所以可以用组合数求出： $\tbinom{7}{2}\tbinom{5}{1}\tbinom{4}{1}\tbinom{3}{1}\tbinom{2}{1}\tbinom{1}{1}$
- 头铁的可以写全排序，然后去掉重复的。
*** 答案
2520

** 第四题
*** 题目
一个包含有 2019 个结点的无向连通图，最少包含多少条边？
*** 解析
随便画一下两个三个结点的情况就明白了

*** 答案
2018

** 第五题
*** 题目
#+BEGIN_EXAMPLE
问题描述
　　给定三个整数 a, b, c，如果一个整数既不是 a 的整数倍也不是 b 的整数倍还不是 c 的整数倍，则这个数称为反倍数。
　　请问在 1 至 n 中有多少个反倍数。
输入格式
　　输入的第一行包含一个整数 n。
　　第二行包含三个整数 a, b, c，相邻两个数之间用一个空格分隔。
输出格式
　　输出一行包含一个整数，表示答案。
样例输入
30
2 3 6
样例输出
10
样例说明
　　以下这些数满足要求：1, 5, 7, 11, 13, 17, 19, 23, 25, 29。
评测用例规模与约定
　　对于 40% 的评测用例，1 <= n <= 10000。
　　对于 80% 的评测用例，1 <= n <= 100000。
　　对于所有评测用例，1 <= n <= 1000000，1 <= a <= n，1 <= b <= n，1 <= c <= n。
#+END_EXAMPLE
*** 解析
直接枚举 1 至 n 所有数，然后统计就行了。
*** 答案
#+BEGIN_SRC c++
#include <iostream>

using namespace std;

int main() {
	long n;
	cin >> n;
	long a, b, c;
	cin >> a >> b >> c;
	long cou = 0;
	for (long i = 1; i <= n; i++) {
		if (i % a && i % b && i % c)
			cou++;
	}
	cout << cou << endl;
	return 0;
}
#+END_SRC

** 第六题
*** 题目
#+BEGIN_EXAMPLE
问题描述
　　给定一个单词，请使用凯撒密码将这个单词加密。
　　凯撒密码是一种替换加密的技术，单词中的所有字母都在字母表上向后偏移3位后被替换成密文。即a变为d，b变为e，...，w变为z，x变为a，y变为b，z变为c。
　　例如，lanqiao会变成odqtldr。
输入格式
　　输入一行，包含一个单词，单词中只包含小写英文字母。
输出格式
　　输出一行，表示加密后的密文。
样例输入
lanqiao
样例输出
odqtldr
评测用例规模与约定
　　对于所有评测用例，单词中的字母个数不超过100。
#+END_EXAMPLE
*** 解析
记录字符相对于 a 的偏移，然后加 3 并对 26 取余，这样就不会超过字符 z
*** 答案
#+BEGIN_SRC c++
#include <iostream>

using namespace std;

char se(char c) {
	int p = c - 'a';
	p = (p + 3) % 26;
	return 'a' + p;
}

int main() {
	char c;
	while (cin >> c) {
		cout << se(c);
	}
	cout << endl;
	return 0;
}
#+END_SRC

** 第七题
*** 题目
#+BEGIN_EXAMPLE
问题描述
　　如果一个序列的奇数项都比前一项大，偶数项都比前一项小，则称为一个摆动序列。即 a[2i]<a[2i-1], a[2i+1]>a[2i]。
　　小明想知道，长度为 m，每个数都是 1 到 n 之间的正整数的摆动序列一共有多少个。
输入格式
　　输入一行包含两个整数 m，n。
输出格式
　　输出一个整数，表示答案。答案可能很大，请输出答案除以10000的余数。
样例输入
3 4
样例输出
14
样例说明
　　以下是符合要求的摆动序列：
2 1 2
2 1 3
2 1 4
3 1 2
3 1 3
3 1 4
3 2 3
3 2 4
4 1 2
4 1 3
4 1 4
4 2 3
4 2 4
4 3 4
评测用例规模与约定
　　对于 20% 的评测用例，1 <= n, m <= 5；
　　对于 50% 的评测用例，1 <= n, m <= 10；
　　对于 80% 的评测用例，1 <= n, m <= 100；
　　对于所有评测用例，1 <= n, m <= 1000。
#+END_EXAMPLE
*** 解析
最朴素的做法就是用 =dfs= 搜索，但 n m 的范围太大了，会超时。

所以我们就要用 dp 来做，首先确定公式的含义。

我们定义 =dp[i][j]= 表示第 i 项上放置比 j 大或小的数字的方案数，如何是偶数项就是比 j 小，奇数项就是比 j 大。

然后预处理初始条件，第一项的情况是固定的， =dp[1][j]= 肯定是 =n - j + 1= 因为比 j 大的数只有这么多。

接下来就是遍历每一行了。

奇数项的公式为 dp[i][j] = dp[i - 1][j - 1] + dp[i][j + 1] ，找到等于 j 的情况数和大于 j 的情况数然后加起来， =dp[i - 1][j - 1]= 表示前一项所有小于 =j - 1= 的情况数， =dp[i][j + 1]= 表示当前项所有大于 =j= 的情况数。

偶数项的公式为 dp[i][j] = dp[i-1][j+1] + dp[i][j-1] ，具体思路和上面一样，只不过方向换了。

最后注意遍历顺序就行了。
