2020-lanqiao-Provincial-Simulation.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<meta name="description" content="2020年蓝桥杯省模拟赛题目解析">
<link rel="alternate"
      type="application/rss+xml"
      href="https://lampze.github.io/rss.xml"
      title="RSS feed for https://lampze.github.io/">
<title>2020年蓝桥杯省模拟赛题解</title>
<meta  name="author" content="lampze" />
      <link href= "static/style.css" rel="stylesheet" type="text/css" />
      <link href= "static/org.css" rel="stylesheet" type="text/css" />
      <meta http-equiv="content-type" content="application/xhtml+xml; charset=UTF-8" />
      <meta name="viewport" content="initial-scale=1,width=device-width,minimum-scale=1"></head>
<body>
<div id="preamble" class="status"><div class="header">
        <a href="https://lampze.github.io">lampze's Blog</a>
      </div></div>
<div id="content">
<div class="post-date">20 4月 2020</div><h1 class="post-title"><a href="https://lampze.github.io/2020-lanqiao-Provincial-Simulation.html">2020年蓝桥杯省模拟赛题解</a></h1>

<div id="outline-container-org41b7e48" class="outline-2">
<h2 id="org41b7e48">题解</h2>
<div class="outline-text-2" id="text-org41b7e48">
</div>
<div id="outline-container-org23de421" class="outline-3">
<h3 id="org23de421">第一题</h3>
<div class="outline-text-3" id="text-org23de421">
</div>
<div id="outline-container-org7758e24" class="outline-4">
<h4 id="org7758e24">题目</h4>
<div class="outline-text-4" id="text-org7758e24">
<p>
在计算机存储中，12.5MB 是多少字节？
</p>
</div>
</div>
<div id="outline-container-org4bfb1bb" class="outline-4">
<h4 id="org4bfb1bb">解析</h4>
<div class="outline-text-4" id="text-org4bfb1bb">
<p>
1MB=1024KB，1KB=1024B
</p>
</div>
</div>
<div id="outline-container-org634b86f" class="outline-4">
<h4 id="org634b86f">答案</h4>
<div class="outline-text-4" id="text-org634b86f">
<p>
13107200
</p>
</div>
</div>
</div>

<div id="outline-container-orgac4d47c" class="outline-3">
<h3 id="orgac4d47c">第二题</h3>
<div class="outline-text-3" id="text-orgac4d47c">
</div>
<div id="outline-container-org115774b" class="outline-4">
<h4 id="org115774b">题目</h4>
<div class="outline-text-4" id="text-org115774b">
<p>
由 1 对括号，可以组成一种合法括号序列：()。
</p>

<p>
由 2 对括号，可以组成两种合法括号序列：()()、(())。
</p>

<p>
由 4 对括号组成的合法括号序列一共有多少种？
</p>
</div>
</div>
<div id="outline-container-orgc642db9" class="outline-4">
<h4 id="orgc642db9">解析</h4>
<div class="outline-text-4" id="text-orgc642db9">
<ul class="org-ul">
<li>直接查找卡特兰数</li>
<li>用栈模拟，左括号相当于入栈，右括号相当于出栈，这样将题目转换成了统计出入栈序列总数了。</li>
</ul>
</div>
</div>
<div id="outline-container-org2cec388" class="outline-4">
<h4 id="org2cec388">答案</h4>
<div class="outline-text-4" id="text-org2cec388">
<p>
14
</p>
</div>
</div>
</div>

<div id="outline-container-orgc656479" class="outline-3">
<h3 id="orgc656479">第三题</h3>
<div class="outline-text-3" id="text-orgc656479">
</div>
<div id="outline-container-org406a279" class="outline-4">
<h4 id="org406a279">题目</h4>
<div class="outline-text-4" id="text-org406a279">
<p>
将 LANQIAO 中的字母重新排列，可以得到不同的单词，LANQIAO、AAILNOQ 等，注意这 7 个字母都要被用上，单词不一定有具体的英文意义。请问，总共能排列如多少个不同的单词。
</p>
</div>
</div>
<div id="outline-container-orgf5a981f" class="outline-4">
<h4 id="orgf5a981f">解析</h4>
<div class="outline-text-4" id="text-orgf5a981f">
<ul class="org-ul">
<li>有两个字母相同，其余都是不同字母，所以可以用组合数求出： \(\tbinom{7}{2}\tbinom{5}{1}\tbinom{4}{1}\tbinom{3}{1}\tbinom{2}{1}\tbinom{1}{1}\)</li>
<li>头铁的可以写全排序，然后去掉重复的。</li>
</ul>
</div>
</div>
<div id="outline-container-orgceaaa8b" class="outline-4">
<h4 id="orgceaaa8b">答案</h4>
<div class="outline-text-4" id="text-orgceaaa8b">
<p>
2520
</p>
</div>
</div>
</div>

<div id="outline-container-org02c2f9e" class="outline-3">
<h3 id="org02c2f9e">第四题</h3>
<div class="outline-text-3" id="text-org02c2f9e">
</div>
<div id="outline-container-org4d7bb82" class="outline-4">
<h4 id="org4d7bb82">题目</h4>
<div class="outline-text-4" id="text-org4d7bb82">
<p>
一个包含有 2019 个结点的无向连通图，最少包含多少条边？
</p>
</div>
</div>
<div id="outline-container-org2839254" class="outline-4">
<h4 id="org2839254">解析</h4>
<div class="outline-text-4" id="text-org2839254">
<p>
随便画一下两个三个结点的情况就明白了
</p>
</div>
</div>

<div id="outline-container-orge44fdbf" class="outline-4">
<h4 id="orge44fdbf">答案</h4>
<div class="outline-text-4" id="text-orge44fdbf">
<p>
2018
</p>
</div>
</div>
</div>

<div id="outline-container-orgbf89cf7" class="outline-3">
<h3 id="orgbf89cf7">第五题</h3>
<div class="outline-text-3" id="text-orgbf89cf7">
</div>
<div id="outline-container-org2bfa432" class="outline-4">
<h4 id="org2bfa432">题目</h4>
<div class="outline-text-4" id="text-org2bfa432">
<pre class="example" id="orgd9c38eb">
问题描述
　　给定三个整数 a, b, c，如果一个整数既不是 a 的整数倍也不是 b 的整数倍还不是 c 的整数倍，则这个数称为反倍数。
　　请问在 1 至 n 中有多少个反倍数。
输入格式
　　输入的第一行包含一个整数 n。
　　第二行包含三个整数 a, b, c，相邻两个数之间用一个空格分隔。
输出格式
　　输出一行包含一个整数，表示答案。
样例输入
30
2 3 6
样例输出
10
样例说明
　　以下这些数满足要求：1, 5, 7, 11, 13, 17, 19, 23, 25, 29。
评测用例规模与约定
　　对于 40% 的评测用例，1 &lt;= n &lt;= 10000。
　　对于 80% 的评测用例，1 &lt;= n &lt;= 100000。
　　对于所有评测用例，1 &lt;= n &lt;= 1000000，1 &lt;= a &lt;= n，1 &lt;= b &lt;= n，1 &lt;= c &lt;= n。
</pre>
</div>
</div>
<div id="outline-container-org9886b15" class="outline-4">
<h4 id="org9886b15">解析</h4>
<div class="outline-text-4" id="text-org9886b15">
<p>
直接枚举 1 至 n 所有数，然后统计就行了。
</p>
</div>
</div>
<div id="outline-container-orga9ae72a" class="outline-4">
<h4 id="orga9ae72a">答案</h4>
<div class="outline-text-4" id="text-orga9ae72a">
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #383a42; font-weight: bold;">#include</span> <span style="color: #014980;">&lt;</span><span style="color: #8a3b3c;">iostream</span><span style="color: #014980;">&gt;</span>

<span style="font-weight: bold;">using</span> <span style="font-weight: bold;">namespace</span> <span style="color: #383a42;">std</span>;

<span style="font-weight: bold;">int</span> <span style="font-weight: bold;">main</span><span style="color: #014980;">()</span> <span style="color: #014980;">{</span>
  <span style="font-weight: bold;">long</span> <span style="color: #383a42;">n</span>;
  cin &gt;&gt; n;
  <span style="font-weight: bold;">long</span> <span style="color: #383a42;">a</span>, <span style="color: #383a42;">b</span>, <span style="color: #383a42;">c</span>;
  cin &gt;&gt; a &gt;&gt; b &gt;&gt; c;
  <span style="font-weight: bold;">long</span> <span style="color: #383a42;">cou</span> = <span style="color: #8a3b3c; font-weight: bold;">0</span>;
  <span style="font-weight: bold;">for</span> <span style="color: #a626a4;">(</span><span style="font-weight: bold;">long</span> <span style="color: #383a42;">i</span> = <span style="color: #8a3b3c; font-weight: bold;">1</span>; i &lt;= n; i++<span style="color: #a626a4;">)</span> <span style="color: #a626a4;">{</span>
    <span style="font-weight: bold;">if</span> <span style="color: #556b2f;">(</span>i % a &amp;&amp; i % b &amp;&amp; i % c<span style="color: #556b2f;">)</span>
      cou++;
  <span style="color: #a626a4;">}</span>
  cout &lt;&lt; cou &lt;&lt; endl;
  <span style="font-weight: bold;">return</span> <span style="color: #8a3b3c; font-weight: bold;">0</span>;
<span style="color: #014980;">}</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgcb06945" class="outline-3">
<h3 id="orgcb06945">第六题</h3>
<div class="outline-text-3" id="text-orgcb06945">
</div>
<div id="outline-container-org8379661" class="outline-4">
<h4 id="org8379661">题目</h4>
<div class="outline-text-4" id="text-org8379661">
<pre class="example" id="org3c8df6c">
问题描述
　　给定一个单词，请使用凯撒密码将这个单词加密。
　　凯撒密码是一种替换加密的技术，单词中的所有字母都在字母表上向后偏移3位后被替换成密文。即a变为d，b变为e，...，w变为z，x变为a，y变为b，z变为c。
　　例如，lanqiao会变成odqtldr。
输入格式
　　输入一行，包含一个单词，单词中只包含小写英文字母。
输出格式
　　输出一行，表示加密后的密文。
样例输入
lanqiao
样例输出
odqtldr
评测用例规模与约定
　　对于所有评测用例，单词中的字母个数不超过100。
</pre>
</div>
</div>
<div id="outline-container-org2ff8748" class="outline-4">
<h4 id="org2ff8748">解析</h4>
<div class="outline-text-4" id="text-org2ff8748">
<p>
记录字符相对于 a 的偏移，然后加 3 并对 26 取余，这样就不会超过字符 z
</p>
</div>
</div>
<div id="outline-container-orgaca5715" class="outline-4">
<h4 id="orgaca5715">答案</h4>
<div class="outline-text-4" id="text-orgaca5715">
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #383a42; font-weight: bold;">#include</span> <span style="color: #014980;">&lt;</span><span style="color: #8a3b3c;">iostream</span><span style="color: #014980;">&gt;</span>

<span style="font-weight: bold;">using</span> <span style="font-weight: bold;">namespace</span> <span style="color: #383a42;">std</span>;

<span style="font-weight: bold;">char</span> <span style="font-weight: bold;">se</span><span style="color: #014980;">(</span><span style="font-weight: bold;">char</span> <span style="color: #383a42;">c</span><span style="color: #014980;">)</span> <span style="color: #014980;">{</span>
  <span style="font-weight: bold;">int</span> <span style="color: #383a42;">p</span> = c - <span style="color: #8a3b3c;">'a'</span>;
  p = <span style="color: #a626a4;">(</span>p + <span style="color: #8a3b3c; font-weight: bold;">3</span><span style="color: #a626a4;">)</span> % <span style="color: #8a3b3c; font-weight: bold;">26</span>;
  <span style="font-weight: bold;">return</span> <span style="color: #8a3b3c;">'a'</span> + p;
<span style="color: #014980;">}</span>

<span style="font-weight: bold;">int</span> <span style="font-weight: bold;">main</span><span style="color: #014980;">()</span> <span style="color: #014980;">{</span>
  <span style="font-weight: bold;">char</span> <span style="color: #383a42;">c</span>;
  <span style="font-weight: bold;">while</span> <span style="color: #a626a4;">(</span>cin &gt;&gt; c<span style="color: #a626a4;">)</span> <span style="color: #a626a4;">{</span>
    cout &lt;&lt; se<span style="color: #556b2f;">(</span>c<span style="color: #556b2f;">)</span>;
  <span style="color: #a626a4;">}</span>
  cout &lt;&lt; endl;
  <span style="font-weight: bold;">return</span> <span style="color: #8a3b3c; font-weight: bold;">0</span>;
<span style="color: #014980;">}</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgcbbab82" class="outline-3">
<h3 id="orgcbbab82">第七题</h3>
<div class="outline-text-3" id="text-orgcbbab82">
</div>
<div id="outline-container-org833da1d" class="outline-4">
<h4 id="org833da1d">题目</h4>
<div class="outline-text-4" id="text-org833da1d">
<pre class="example" id="org2602347">
问题描述
　　如果一个序列的奇数项都比前一项大，偶数项都比前一项小，则称为一个摆动序列。即 a[2i]&lt;a[2i-1], a[2i+1]&gt;a[2i]。
　　小明想知道，长度为 m，每个数都是 1 到 n 之间的正整数的摆动序列一共有多少个。
输入格式
　　输入一行包含两个整数 m，n。
输出格式
　　输出一个整数，表示答案。答案可能很大，请输出答案除以10000的余数。
样例输入
3 4
样例输出
14
样例说明
　　以下是符合要求的摆动序列：
2 1 2
2 1 3
2 1 4
3 1 2
3 1 3
3 1 4
3 2 3
3 2 4
4 1 2
4 1 3
4 1 4
4 2 3
4 2 4
4 3 4
评测用例规模与约定
　　对于 20% 的评测用例，1 &lt;= n, m &lt;= 5；
　　对于 50% 的评测用例，1 &lt;= n, m &lt;= 10；
　　对于 80% 的评测用例，1 &lt;= n, m &lt;= 100；
　　对于所有评测用例，1 &lt;= n, m &lt;= 1000。
</pre>
</div>
</div>
<div id="outline-container-orga2493cc" class="outline-4">
<h4 id="orga2493cc">解析</h4>
<div class="outline-text-4" id="text-orga2493cc">
<p>
最朴素的做法就是用 <code>dfs</code> 搜索，但 n m 的范围太大了，会超时。
</p>

<p>
所以我们就要用 dp 来做，首先确定公式的含义。
</p>

<p>
我们定义 <code>dp[i][j]</code> 表示第 i 项上放置比 j 大或小的数字的方案数，如何是偶数项就是比 j 小，奇数项就是比 j 大。
</p>

<p>
然后预处理初始条件，第一项的情况是固定的， <code>dp[1][j]</code> 肯定是 <code>n - j + 1</code> 因为比 j 大的数只有这么多。
</p>

<p>
接下来就是遍历每一行了。
</p>

<p>
奇数项的公式为 dp[i][j] = dp[i - 1][j - 1] + dp[i][j + 1] ，找到等于 j 的情况数和大于 j 的情况数然后加起来， <code>dp[i - 1][j - 1]</code> 表示前一项所有小于 <code>j - 1</code> 的情况数， <code>dp[i][j + 1]</code> 表示当前项所有大于 <code>j</code> 的情况数。
</p>

<p>
偶数项的公式为 dp[i][j] = dp[i-1][j+1] + dp[i][j-1] ，具体思路和上面一样，只不过方向换了。
</p>

<p>
最后注意遍历顺序就行了。
</p>
</div>
</div>
