posts/2020-lanqiao-Provincial-Simulation.org
*** 答案
#+BEGIN_SRC c++
#include <iostream>
using namespace std;
int dp[1004][1004];
int main() {
    int m,n;
    cin>>m>>n;

    for(int i = 1; i <= n; i++)
        dp[1][i] = n - i + 1;

    for(int i = 2; i <= m; i++)
        if(i % 2)
            for(int j = n; j >= 1; j--)
                dp[i][j] = (dp[i-1][j-1] + dp[i][j+1]) % 10000;
        else
            for(int j = 1; j <= n; j++)
                dp[i][j] = (dp[i-1][j+1] + dp[i][j-1]) % 10000;

    cout << (m % 2 ? dp[m][1] : dp[m][n]) << endl;
    return 0;
}
#+END_SRC

** 第八题
*** 题目
#+BEGIN_EXAMPLE
问题描述
　　对于一个 n 行 m 列的表格，我们可以使用螺旋的方式给表格依次填上正整数，我们称填好的表格为一个螺旋矩阵。
　　例如，一个 4 行 5 列的螺旋矩阵如下：
1 2 3 4 5
14 15 16 17 6
13 20 19 18 7
12 11 10 9 8
输入格式
　　输入的第一行包含两个整数 n, m，分别表示螺旋矩阵的行数和列数。
　　第二行包含两个整数 r, c，表示要求的行号和列号。
输出格式
　　输出一个整数，表示螺旋矩阵中第 r 行第 c 列的元素的值。
样例输入
4 5
2 2
样例输出
15
评测用例规模与约定
　　对于 30% 的评测用例，2 <= n, m <= 20。
　　对于 70% 的评测用例，2 <= n, m <= 100。
　　对于所有评测用例，2 <= n, m <= 1000，1 <= r <= n，1 <= c <= m。
#+END_EXAMPLE
*** 解析
最简单的方法就是把整个螺旋矩阵画出来，然后输出特定位置的数。
*** 答案
#+BEGIN_SRC c++
#include <iostream>

using namespace std;

int main() {
	int n, m;
	cin >> n >> m;
	int r, c;
	cin >> r >> c;
	int all[n][m], tot = 1, x = 0, y = 0;
	for (int i = 0; i < n; i++)
		for (int j = 0; j < m; j++)
			all[i][j] = 0;
	all[0][0] = 1;
	while (tot != n * m) {
		while (y + 1 < m && !all[x][y + 1])
			all[x][++y] = ++tot;
		while (x + 1 < n && !all[x + 1][y])
			all[++x][y] = ++tot;
		while (y - 1 >= 0 && !all[x][y - 1])
			all[x][--y] = ++tot;
		while (x - 1 >= 0 && !all[x - 1][y])
			all[--x][y] = ++tot;
	}
	cout << all[r - 1][c - 1] << endl;
	return 0;
}
#+END_SRC
** 第九题
*** 题目
#+BEGIN_EXAMPLE
问题描述
　　2015年，全中国实现了户户通电。作为一名电力建设者，小明正在帮助一带一路上的国家通电。
　　这一次，小明要帮助 n 个村庄通电，其中 1 号村庄正好可以建立一个发电站，所发的电足够所有村庄使用。
　　现在，这 n 个村庄之间都没有电线相连，小明主要要做的是架设电线连接这些村庄，使得所有村庄都直接或间接的与发电站相通。
　　小明测量了所有村庄的位置（坐标）和高度，如果要连接两个村庄，小明需要花费两个村庄之间的坐标距离加上高度差的平方，形式化描述为坐标为 (x_1, y_1) 高度为 h_1 的村庄与坐标为 (x_2, y_2) 高度为 h_2 的村庄之间连接的费用为
　　sqrt((x_1-x_2)*(x_1-x_2)+(y_1-y_2)*(y_1-y_2))+(h_1-h_2)*(h_1-h_2)。
　　在上式中 sqrt 表示取括号内的平方根。请注意括号的位置，高度的计算方式与横纵坐标的计算方式不同。
　　由于经费有限，请帮助小明计算他至少要花费多少费用才能使这 n 个村庄都通电。
输入格式
　　输入的第一行包含一个整数 n ，表示村庄的数量。
　　接下来 n 行，每个三个整数 x, y, h，分别表示一个村庄的横、纵坐标和高度，其中第一个村庄可以建立发电站。
输出格式
　　输出一行，包含一个实数，四舍五入保留 2 位小数，表示答案。
样例输入
4
1 1 3
9 9 7
8 8 6
4 5 4
样例输出
17.41
评测用例规模与约定
　　对于 30% 的评测用例，1 <= n <= 10；
　　对于 60% 的评测用例，1 <= n <= 100；
　　对于所有评测用例，1 <= n <= 1000，0 <= x, y, h <= 10000。
#+END_EXAMPLE
*** 解析
可以抽象成有 n 个全相连结点的图，边是拉电线的费用，然后找最小生成树就好了。
