2020-lanqiao-Provincial-Simulation.html
<div id="outline-container-org8780c21" class="outline-4">
<h4 id="org8780c21">答案</h4>
<div class="outline-text-4" id="text-org8780c21">
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #383a42; font-weight: bold;">#include</span> <span style="color: #014980;">&lt;</span><span style="color: #8a3b3c;">iostream</span><span style="color: #014980;">&gt;</span>
<span style="font-weight: bold;">using</span> <span style="font-weight: bold;">namespace</span> <span style="color: #383a42;">std</span>;
<span style="font-weight: bold;">int</span> <span style="color: #383a42;">dp</span><span style="color: #014980;">[</span><span style="color: #8a3b3c; font-weight: bold;">1004</span><span style="color: #014980;">][</span><span style="color: #8a3b3c; font-weight: bold;">1004</span><span style="color: #014980;">]</span>;
<span style="font-weight: bold;">int</span> <span style="font-weight: bold;">main</span><span style="color: #014980;">()</span> <span style="color: #014980;">{</span>
    <span style="font-weight: bold;">int</span> <span style="color: #383a42;">m</span>,<span style="color: #383a42;">n</span>;
    cin&gt;&gt;m&gt;&gt;n;

    <span style="font-weight: bold;">for</span><span style="color: #a626a4;">(</span><span style="font-weight: bold;">int</span> <span style="color: #383a42;">i</span> = <span style="color: #8a3b3c; font-weight: bold;">1</span>; i &lt;= n; i++<span style="color: #a626a4;">)</span>
        dp<span style="color: #a626a4;">[</span><span style="color: #8a3b3c; font-weight: bold;">1</span><span style="color: #a626a4;">][</span>i<span style="color: #a626a4;">]</span> = n - i + <span style="color: #8a3b3c; font-weight: bold;">1</span>;

    <span style="font-weight: bold;">for</span><span style="color: #a626a4;">(</span><span style="font-weight: bold;">int</span> <span style="color: #383a42;">i</span> = <span style="color: #8a3b3c; font-weight: bold;">2</span>; i &lt;= m; i++<span style="color: #a626a4;">)</span>
        <span style="font-weight: bold;">if</span><span style="color: #a626a4;">(</span>i % <span style="color: #8a3b3c; font-weight: bold;">2</span><span style="color: #a626a4;">)</span>
            <span style="font-weight: bold;">for</span><span style="color: #a626a4;">(</span><span style="font-weight: bold;">int</span> <span style="color: #383a42;">j</span> = n; j &gt;= <span style="color: #8a3b3c; font-weight: bold;">1</span>; j--<span style="color: #a626a4;">)</span>
                dp<span style="color: #a626a4;">[</span>i<span style="color: #a626a4;">][</span>j<span style="color: #a626a4;">]</span> = <span style="color: #a626a4;">(</span>dp<span style="color: #556b2f;">[</span>i-<span style="color: #8a3b3c; font-weight: bold;">1</span><span style="color: #556b2f;">][</span>j-<span style="color: #8a3b3c; font-weight: bold;">1</span><span style="color: #556b2f;">]</span> + dp<span style="color: #556b2f;">[</span>i<span style="color: #556b2f;">][</span>j+<span style="color: #8a3b3c; font-weight: bold;">1</span><span style="color: #556b2f;">]</span><span style="color: #a626a4;">)</span> % <span style="color: #8a3b3c; font-weight: bold;">10000</span>;
        <span style="font-weight: bold;">else</span>
            <span style="font-weight: bold;">for</span><span style="color: #a626a4;">(</span><span style="font-weight: bold;">int</span> <span style="color: #383a42;">j</span> = <span style="color: #8a3b3c; font-weight: bold;">1</span>; j &lt;= n; j++<span style="color: #a626a4;">)</span>
                dp<span style="color: #a626a4;">[</span>i<span style="color: #a626a4;">][</span>j<span style="color: #a626a4;">]</span> = <span style="color: #a626a4;">(</span>dp<span style="color: #556b2f;">[</span>i-<span style="color: #8a3b3c; font-weight: bold;">1</span><span style="color: #556b2f;">][</span>j+<span style="color: #8a3b3c; font-weight: bold;">1</span><span style="color: #556b2f;">]</span> + dp<span style="color: #556b2f;">[</span>i<span style="color: #556b2f;">][</span>j-<span style="color: #8a3b3c; font-weight: bold;">1</span><span style="color: #556b2f;">]</span><span style="color: #a626a4;">)</span> % <span style="color: #8a3b3c; font-weight: bold;">10000</span>;

    cout &lt;&lt; <span style="color: #a626a4;">(</span>m % <span style="color: #8a3b3c; font-weight: bold;">2</span> ? dp<span style="color: #556b2f;">[</span>m<span style="color: #556b2f;">][</span><span style="color: #8a3b3c; font-weight: bold;">1</span><span style="color: #556b2f;">]</span> : dp<span style="color: #556b2f;">[</span>m<span style="color: #556b2f;">][</span>n<span style="color: #556b2f;">]</span><span style="color: #a626a4;">)</span> &lt;&lt; endl;
    <span style="font-weight: bold;">return</span> <span style="color: #8a3b3c; font-weight: bold;">0</span>;
<span style="color: #014980;">}</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgadd250d" class="outline-3">
<h3 id="orgadd250d">第八题</h3>
<div class="outline-text-3" id="text-orgadd250d">
</div>
<div id="outline-container-orgdafd93a" class="outline-4">
<h4 id="orgdafd93a">题目</h4>
<div class="outline-text-4" id="text-orgdafd93a">
<pre class="example" id="org61c1073">
问题描述
　　对于一个 n 行 m 列的表格，我们可以使用螺旋的方式给表格依次填上正整数，我们称填好的表格为一个螺旋矩阵。
　　例如，一个 4 行 5 列的螺旋矩阵如下：
1 2 3 4 5
14 15 16 17 6
13 20 19 18 7
12 11 10 9 8
输入格式
　　输入的第一行包含两个整数 n, m，分别表示螺旋矩阵的行数和列数。
　　第二行包含两个整数 r, c，表示要求的行号和列号。
输出格式
　　输出一个整数，表示螺旋矩阵中第 r 行第 c 列的元素的值。
样例输入
4 5
2 2
样例输出
15
评测用例规模与约定
　　对于 30% 的评测用例，2 &lt;= n, m &lt;= 20。
　　对于 70% 的评测用例，2 &lt;= n, m &lt;= 100。
　　对于所有评测用例，2 &lt;= n, m &lt;= 1000，1 &lt;= r &lt;= n，1 &lt;= c &lt;= m。
</pre>
</div>
</div>
<div id="outline-container-orgfc119ca" class="outline-4">
<h4 id="orgfc119ca">解析</h4>
<div class="outline-text-4" id="text-orgfc119ca">
<p>
最简单的方法就是把整个螺旋矩阵画出来，然后输出特定位置的数。
</p>
</div>
</div>
<div id="outline-container-org646a5d1" class="outline-4">
<h4 id="org646a5d1">答案</h4>
<div class="outline-text-4" id="text-org646a5d1">
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #383a42; font-weight: bold;">#include</span> <span style="color: #014980;">&lt;</span><span style="color: #8a3b3c;">iostream</span><span style="color: #014980;">&gt;</span>

<span style="font-weight: bold;">using</span> <span style="font-weight: bold;">namespace</span> <span style="color: #383a42;">std</span>;

<span style="font-weight: bold;">int</span> <span style="font-weight: bold;">main</span><span style="color: #014980;">()</span> <span style="color: #014980;">{</span>
  <span style="font-weight: bold;">int</span> <span style="color: #383a42;">n</span>, <span style="color: #383a42;">m</span>;
  cin &gt;&gt; n &gt;&gt; m;
  <span style="font-weight: bold;">int</span> <span style="color: #383a42;">r</span>, <span style="color: #383a42;">c</span>;
  cin &gt;&gt; r &gt;&gt; c;
  <span style="font-weight: bold;">int</span> <span style="color: #383a42;">all</span><span style="color: #a626a4;">[</span>n<span style="color: #a626a4;">][</span>m<span style="color: #a626a4;">]</span>, <span style="color: #383a42;">tot</span> = <span style="color: #8a3b3c; font-weight: bold;">1</span>, <span style="color: #383a42;">x</span> = <span style="color: #8a3b3c; font-weight: bold;">0</span>, <span style="color: #383a42;">y</span> = <span style="color: #8a3b3c; font-weight: bold;">0</span>;
  <span style="font-weight: bold;">for</span> <span style="color: #a626a4;">(</span><span style="font-weight: bold;">int</span> <span style="color: #383a42;">i</span> = <span style="color: #8a3b3c; font-weight: bold;">0</span>; i &lt; n; i++<span style="color: #a626a4;">)</span>
    <span style="font-weight: bold;">for</span> <span style="color: #a626a4;">(</span><span style="font-weight: bold;">int</span> <span style="color: #383a42;">j</span> = <span style="color: #8a3b3c; font-weight: bold;">0</span>; j &lt; m; j++<span style="color: #a626a4;">)</span>
      all<span style="color: #a626a4;">[</span>i<span style="color: #a626a4;">][</span>j<span style="color: #a626a4;">]</span> = <span style="color: #8a3b3c; font-weight: bold;">0</span>;
  all<span style="color: #a626a4;">[</span><span style="color: #8a3b3c; font-weight: bold;">0</span><span style="color: #a626a4;">][</span><span style="color: #8a3b3c; font-weight: bold;">0</span><span style="color: #a626a4;">]</span> = <span style="color: #8a3b3c; font-weight: bold;">1</span>;
  <span style="font-weight: bold;">while</span> <span style="color: #a626a4;">(</span>tot != n * m<span style="color: #a626a4;">)</span> <span style="color: #a626a4;">{</span>
    <span style="font-weight: bold;">while</span> <span style="color: #556b2f;">(</span>y + <span style="color: #8a3b3c; font-weight: bold;">1</span> &lt; m &amp;&amp; <span style="color: #383a42; font-weight: bold;">!</span>all<span style="color: #b751b6;">[</span>x<span style="color: #b751b6;">][</span>y + <span style="color: #8a3b3c; font-weight: bold;">1</span><span style="color: #b751b6;">]</span><span style="color: #556b2f;">)</span>
      all<span style="color: #556b2f;">[</span>x<span style="color: #556b2f;">][</span>++y<span style="color: #556b2f;">]</span> = ++tot;
    <span style="font-weight: bold;">while</span> <span style="color: #556b2f;">(</span>x + <span style="color: #8a3b3c; font-weight: bold;">1</span> &lt; n &amp;&amp; <span style="color: #383a42; font-weight: bold;">!</span>all<span style="color: #b751b6;">[</span>x + <span style="color: #8a3b3c; font-weight: bold;">1</span><span style="color: #b751b6;">][</span>y<span style="color: #b751b6;">]</span><span style="color: #556b2f;">)</span>
      all<span style="color: #556b2f;">[</span>++x<span style="color: #556b2f;">][</span>y<span style="color: #556b2f;">]</span> = ++tot;
    <span style="font-weight: bold;">while</span> <span style="color: #556b2f;">(</span>y - <span style="color: #8a3b3c; font-weight: bold;">1</span> &gt;= <span style="color: #8a3b3c; font-weight: bold;">0</span> &amp;&amp; <span style="color: #383a42; font-weight: bold;">!</span>all<span style="color: #b751b6;">[</span>x<span style="color: #b751b6;">][</span>y - <span style="color: #8a3b3c; font-weight: bold;">1</span><span style="color: #b751b6;">]</span><span style="color: #556b2f;">)</span>
      all<span style="color: #556b2f;">[</span>x<span style="color: #556b2f;">][</span>--y<span style="color: #556b2f;">]</span> = ++tot;
    <span style="font-weight: bold;">while</span> <span style="color: #556b2f;">(</span>x - <span style="color: #8a3b3c; font-weight: bold;">1</span> &gt;= <span style="color: #8a3b3c; font-weight: bold;">0</span> &amp;&amp; <span style="color: #383a42; font-weight: bold;">!</span>all<span style="color: #b751b6;">[</span>x - <span style="color: #8a3b3c; font-weight: bold;">1</span><span style="color: #b751b6;">][</span>y<span style="color: #b751b6;">]</span><span style="color: #556b2f;">)</span>
      all<span style="color: #556b2f;">[</span>--x<span style="color: #556b2f;">][</span>y<span style="color: #556b2f;">]</span> = ++tot;
  <span style="color: #a626a4;">}</span>
  cout &lt;&lt; all<span style="color: #a626a4;">[</span>r - <span style="color: #8a3b3c; font-weight: bold;">1</span><span style="color: #a626a4;">][</span>c - <span style="color: #8a3b3c; font-weight: bold;">1</span><span style="color: #a626a4;">]</span> &lt;&lt; endl;
  <span style="font-weight: bold;">return</span> <span style="color: #8a3b3c; font-weight: bold;">0</span>;
<span style="color: #014980;">}</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org41a6e00" class="outline-3">
<h3 id="org41a6e00">第九题</h3>
<div class="outline-text-3" id="text-org41a6e00">
</div>
<div id="outline-container-org82e14ff" class="outline-4">
<h4 id="org82e14ff">题目</h4>
<div class="outline-text-4" id="text-org82e14ff">
<pre class="example" id="orgc94669d">
问题描述
　　2015年，全中国实现了户户通电。作为一名电力建设者，小明正在帮助一带一路上的国家通电。
　　这一次，小明要帮助 n 个村庄通电，其中 1 号村庄正好可以建立一个发电站，所发的电足够所有村庄使用。
　　现在，这 n 个村庄之间都没有电线相连，小明主要要做的是架设电线连接这些村庄，使得所有村庄都直接或间接的与发电站相通。
　　小明测量了所有村庄的位置（坐标）和高度，如果要连接两个村庄，小明需要花费两个村庄之间的坐标距离加上高度差的平方，形式化描述为坐标为 (x_1, y_1) 高度为 h_1 的村庄与坐标为 (x_2, y_2) 高度为 h_2 的村庄之间连接的费用为
　　sqrt((x_1-x_2)*(x_1-x_2)+(y_1-y_2)*(y_1-y_2))+(h_1-h_2)*(h_1-h_2)。
　　在上式中 sqrt 表示取括号内的平方根。请注意括号的位置，高度的计算方式与横纵坐标的计算方式不同。
　　由于经费有限，请帮助小明计算他至少要花费多少费用才能使这 n 个村庄都通电。
输入格式
　　输入的第一行包含一个整数 n ，表示村庄的数量。
　　接下来 n 行，每个三个整数 x, y, h，分别表示一个村庄的横、纵坐标和高度，其中第一个村庄可以建立发电站。
输出格式
　　输出一行，包含一个实数，四舍五入保留 2 位小数，表示答案。
样例输入
4
1 1 3
9 9 7
8 8 6
4 5 4
样例输出
17.41
评测用例规模与约定
　　对于 30% 的评测用例，1 &lt;= n &lt;= 10；
　　对于 60% 的评测用例，1 &lt;= n &lt;= 100；
　　对于所有评测用例，1 &lt;= n &lt;= 1000，0 &lt;= x, y, h &lt;= 10000。
</pre>
</div>
</div>
<div id="outline-container-orga5b6409" class="outline-4">
<h4 id="orga5b6409">解析</h4>
<div class="outline-text-4" id="text-orga5b6409">
<p>
可以抽象成有 n 个全相连结点的图，边是拉电线的费用，然后找最小生成树就好了。
</p>
</div>
</div>
