posts/2020-lanqiao-Provincial-Simulation.org
*** 答案
#+BEGIN_SRC c++
#include <iostream>
#include <queue>
#include <cmath>
#include <cstdio>

using namespace std;

struct poi {
	int x, y, h;
};

struct roa {
	int to;
	float len;
	bool operator<(const roa& a) const {
		return len > a.len;
	}
};

float calc(poi a, poi b) {
	int x = a.x - b.x, y = a.y - b.y,h = a.h - b.h;
	return sqrt(x * x + y * y) + h * h;
}

int check[1001];

int main() {
	int n;
	cin >> n;
	poi all[n];
	for (int i = 0; i < n; i++)
		cin >> all[i].x >> all[i].y >> all[i].h;

	//for (int i = 0; i < n; i++) {
	//	for (int j = 0; j < n; j++)
	//		cout << calc(all[i], all[j]) << " ";
	//	cout << endl;
	//}

	priority_queue<roa> q;
	for (int i = 1; i < n; i++) {
		roa *a = new roa;
		a->to = i;
		a->len = calc(all[i], all[0]);
		q.push(*a);
	}
	int cou = 1;
	float sum = 0;
	check[0] = true;
	while (!q.empty() && cou < n) {
		roa a = q.top();
		q.pop();
		if (check[a.to])
			continue;
		sum += a.len;
		cou++;
		check[a.to] = true;
		for (int i = 0; i < n; i++)
			if (!check[i]) {
				roa *nex = new roa;
				nex->to = i;
				nex->len = calc(all[i], all[a.to]);
				q.push(*nex);
			}
	}
	printf("%.2f\n",round(sum * 100) / 100);
	return 0;
}
#+END_SRC
** 第十题
*** 题目
#+BEGIN_EXAMPLE
问题描述
　　小明和朋友们一起去郊外植树，他们带了一些在自己实验室精心研究出的小树苗。
　　小明和朋友们一共有 n 个人，他们经过精心挑选，在一块空地上每个人挑选了一个适合植树的位置，总共 n 个。他们准备把自己带的树苗都植下去。
　　然而，他们遇到了一个困难：有的树苗比较大，而有的位置挨太近，导致两棵树植下去后会撞在一起。
　　他们将树看成一个圆，圆心在他们找的位置上。如果两棵树对应的圆相交，这两棵树就不适合同时植下（相切不受影响），称为两棵树冲突。
　　小明和朋友们决定先合计合计，只将其中的一部分树植下去，保证没有互相冲突的树。他们同时希望这些树所能覆盖的面积和（圆面积和）最大。
输入格式
　　输入的第一行包含一个整数 n ，表示人数，即准备植树的位置数。
　　接下来 n 行，每行三个整数 x, y, r，表示一棵树在空地上的横、纵坐标和半径。
输出格式
　　输出一行包含一个整数，表示在不冲突下可以植树的面积和。由于每棵树的面积都是圆周率的整数倍，请输出答案除以圆周率后的值（应当是一个整数）。
样例输入
6
1 1 2
1 4 2
1 7 2
4 1 2
4 4 2
4 7 2
样例输出
12
评测用例规模与约定
　　对于 30% 的评测用例，1 <= n <= 10；
　　对于 60% 的评测用例，1 <= n <= 20；
　　对于所有评测用例，1 <= n <= 30，0 <= x, y <= 1000，1 <= r <= 1000。
#+END_EXAMPLE
*** 解析
只想出了 =dfs= 搜索的方法，最高有 30 层，每层最多有两个分支，所以最高会有 =2^30= 次操作，但大部分都会被剪掉，不知道能不能过全部用例。

简单来说就是每次有两种操作，种或者不种，不种是每次都可以选的，种的话就要和之前种下的树检测一下有没有冲突，记录好树的状态并写好回溯就行了。
