2020-lanqiao-Provincial-Simulation.html
<div id="outline-container-org5d59d19" class="outline-4">
<h4 id="org5d59d19">答案</h4>
<div class="outline-text-4" id="text-org5d59d19">
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #383a42; font-weight: bold;">#include</span> <span style="color: #014980;">&lt;</span><span style="color: #8a3b3c;">iostream</span><span style="color: #014980;">&gt;</span>
<span style="color: #383a42; font-weight: bold;">#include</span> <span style="color: #014980;">&lt;</span><span style="color: #8a3b3c;">queue</span><span style="color: #014980;">&gt;</span>
<span style="color: #383a42; font-weight: bold;">#include</span> <span style="color: #014980;">&lt;</span><span style="color: #8a3b3c;">cmath</span><span style="color: #014980;">&gt;</span>
<span style="color: #383a42; font-weight: bold;">#include</span> <span style="color: #014980;">&lt;</span><span style="color: #8a3b3c;">cstdio</span><span style="color: #014980;">&gt;</span>

<span style="font-weight: bold;">using</span> <span style="font-weight: bold;">namespace</span> <span style="color: #383a42;">std</span>;

<span style="font-weight: bold;">struct</span> <span style="font-weight: bold;">poi</span> <span style="color: #014980;">{</span>
  <span style="font-weight: bold;">int</span> <span style="color: #383a42;">x</span>, <span style="color: #383a42;">y</span>, <span style="color: #383a42;">h</span>;
<span style="color: #014980;">}</span>;

<span style="font-weight: bold;">struct</span> <span style="font-weight: bold;">roa</span> <span style="color: #014980;">{</span>
  <span style="font-weight: bold;">int</span> <span style="color: #383a42;">to</span>;
  <span style="font-weight: bold;">float</span> <span style="color: #383a42;">len</span>;
  <span style="font-weight: bold;">bool</span> <span style="font-weight: bold;">operator</span><span style="font-weight: bold;">&lt;</span><span style="color: #a626a4;">(</span><span style="font-weight: bold;">const</span> <span style="font-weight: bold;">roa</span>&amp; <span style="color: #383a42;">a</span><span style="color: #a626a4;">)</span> <span style="font-weight: bold;">const</span> <span style="color: #a626a4;">{</span>
    <span style="font-weight: bold;">return</span> len &gt; a.len;
  <span style="color: #a626a4;">}</span>
<span style="color: #014980;">}</span>;

<span style="font-weight: bold;">float</span> <span style="font-weight: bold;">calc</span><span style="color: #014980;">(</span><span style="font-weight: bold;">poi</span> <span style="color: #383a42;">a</span>, <span style="font-weight: bold;">poi</span> <span style="color: #383a42;">b</span><span style="color: #014980;">)</span> <span style="color: #014980;">{</span>
  <span style="font-weight: bold;">int</span> <span style="color: #383a42;">x</span> = a.x - b.x, <span style="color: #383a42;">y</span> = a.y - b.y,<span style="color: #383a42;">h</span> = a.h - b.h;
  <span style="font-weight: bold;">return</span> sqrt<span style="color: #a626a4;">(</span>x * x + y * y<span style="color: #a626a4;">)</span> + h * h;
<span style="color: #014980;">}</span>

<span style="font-weight: bold;">int</span> <span style="color: #383a42;">check</span><span style="color: #014980;">[</span><span style="color: #8a3b3c; font-weight: bold;">1001</span><span style="color: #014980;">]</span>;

<span style="font-weight: bold;">int</span> <span style="font-weight: bold;">main</span><span style="color: #014980;">()</span> <span style="color: #014980;">{</span>
  <span style="font-weight: bold;">int</span> <span style="color: #383a42;">n</span>;
  cin &gt;&gt; n;
  <span style="font-weight: bold;">poi</span> <span style="color: #383a42;">all</span><span style="color: #a626a4;">[</span>n<span style="color: #a626a4;">]</span>;
  <span style="font-weight: bold;">for</span> <span style="color: #a626a4;">(</span><span style="font-weight: bold;">int</span> <span style="color: #383a42;">i</span> = <span style="color: #8a3b3c; font-weight: bold;">0</span>; i &lt; n; i++<span style="color: #a626a4;">)</span>
    cin &gt;&gt; all<span style="color: #a626a4;">[</span>i<span style="color: #a626a4;">]</span>.x &gt;&gt; all<span style="color: #a626a4;">[</span>i<span style="color: #a626a4;">]</span>.y &gt;&gt; all<span style="color: #a626a4;">[</span>i<span style="color: #a626a4;">]</span>.h;

  <span style="color: #556b2f;">//</span><span style="color: #556b2f;">for (int i = 0; i &lt; n; i++) {</span>
  <span style="color: #556b2f;">//  </span><span style="color: #556b2f;">for (int j = 0; j &lt; n; j++)</span>
  <span style="color: #556b2f;">//    </span><span style="color: #556b2f;">cout &lt;&lt; calc(all[i], all[j]) &lt;&lt; " ";</span>
  <span style="color: #556b2f;">//  </span><span style="color: #556b2f;">cout &lt;&lt; endl;</span>
  <span style="color: #556b2f;">//</span><span style="color: #556b2f;">}</span>

  <span style="font-weight: bold;">priority_queue</span><span style="color: #a626a4;">&lt;</span><span style="font-weight: bold;">roa</span><span style="color: #a626a4;">&gt;</span> <span style="color: #383a42;">q</span>;
  <span style="font-weight: bold;">for</span> <span style="color: #a626a4;">(</span><span style="font-weight: bold;">int</span> <span style="color: #383a42;">i</span> = <span style="color: #8a3b3c; font-weight: bold;">1</span>; i &lt; n; i++<span style="color: #a626a4;">)</span> <span style="color: #a626a4;">{</span>
    <span style="font-weight: bold;">roa</span> *<span style="color: #383a42;">a</span> = <span style="font-weight: bold;">new</span> <span style="font-weight: bold;">roa</span>;
    a-&gt;to = i;
    a-&gt;len = calc<span style="color: #556b2f;">(</span>all<span style="color: #b751b6;">[</span>i<span style="color: #b751b6;">]</span>, all<span style="color: #b751b6;">[</span><span style="color: #8a3b3c; font-weight: bold;">0</span><span style="color: #b751b6;">]</span><span style="color: #556b2f;">)</span>;
    q.push<span style="color: #556b2f;">(</span>*a<span style="color: #556b2f;">)</span>;
  <span style="color: #a626a4;">}</span>
  <span style="font-weight: bold;">int</span> <span style="color: #383a42;">cou</span> = <span style="color: #8a3b3c; font-weight: bold;">1</span>;
  <span style="font-weight: bold;">float</span> <span style="color: #383a42;">sum</span> = <span style="color: #8a3b3c; font-weight: bold;">0</span>;
  check<span style="color: #a626a4;">[</span><span style="color: #8a3b3c; font-weight: bold;">0</span><span style="color: #a626a4;">]</span> = <span style="color: #383a42;">true</span>;
  <span style="font-weight: bold;">while</span> <span style="color: #a626a4;">(</span><span style="color: #383a42; font-weight: bold;">!</span>q.empty<span style="color: #556b2f;">()</span> &amp;&amp; cou &lt; n<span style="color: #a626a4;">)</span> <span style="color: #a626a4;">{</span>
    <span style="font-weight: bold;">roa</span> <span style="color: #383a42;">a</span> = q.top<span style="color: #556b2f;">()</span>;
    q.pop<span style="color: #556b2f;">()</span>;
    <span style="font-weight: bold;">if</span> <span style="color: #556b2f;">(</span>check<span style="color: #b751b6;">[</span>a.to<span style="color: #b751b6;">]</span><span style="color: #556b2f;">)</span>
      <span style="font-weight: bold;">continue</span>;
    sum += a.len;
    cou++;
    check<span style="color: #556b2f;">[</span>a.to<span style="color: #556b2f;">]</span> = <span style="color: #383a42;">true</span>;
    <span style="font-weight: bold;">for</span> <span style="color: #556b2f;">(</span><span style="font-weight: bold;">int</span> <span style="color: #383a42;">i</span> = <span style="color: #8a3b3c; font-weight: bold;">0</span>; i &lt; n; i++<span style="color: #556b2f;">)</span>
      <span style="font-weight: bold;">if</span> <span style="color: #556b2f;">(</span><span style="color: #383a42; font-weight: bold;">!</span>check<span style="color: #b751b6;">[</span>i<span style="color: #b751b6;">]</span><span style="color: #556b2f;">)</span> <span style="color: #556b2f;">{</span>
        <span style="font-weight: bold;">roa</span> *<span style="color: #383a42;">nex</span> = <span style="font-weight: bold;">new</span> <span style="font-weight: bold;">roa</span>;
        nex-&gt;to = i;
        nex-&gt;len = calc<span style="color: #b751b6;">(</span>all<span style="color: #014980;">[</span>i<span style="color: #014980;">]</span>, all<span style="color: #014980;">[</span>a.to<span style="color: #014980;">]</span><span style="color: #b751b6;">)</span>;
        q.push<span style="color: #b751b6;">(</span>*nex<span style="color: #b751b6;">)</span>;
      <span style="color: #556b2f;">}</span>
  <span style="color: #a626a4;">}</span>
  printf<span style="color: #a626a4;">(</span><span style="color: #8a3b3c;">"%.2f\n"</span>,round<span style="color: #556b2f;">(</span>sum * <span style="color: #8a3b3c; font-weight: bold;">100</span><span style="color: #556b2f;">)</span> / <span style="color: #8a3b3c; font-weight: bold;">100</span><span style="color: #a626a4;">)</span>;
  <span style="font-weight: bold;">return</span> <span style="color: #8a3b3c; font-weight: bold;">0</span>;
<span style="color: #014980;">}</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgc0fb018" class="outline-3">
<h3 id="orgc0fb018">第十题</h3>
<div class="outline-text-3" id="text-orgc0fb018">
</div>
<div id="outline-container-org94cf9ff" class="outline-4">
<h4 id="org94cf9ff">题目</h4>
<div class="outline-text-4" id="text-org94cf9ff">
<pre class="example" id="org56f9a1d">
问题描述
　　小明和朋友们一起去郊外植树，他们带了一些在自己实验室精心研究出的小树苗。
　　小明和朋友们一共有 n 个人，他们经过精心挑选，在一块空地上每个人挑选了一个适合植树的位置，总共 n 个。他们准备把自己带的树苗都植下去。
　　然而，他们遇到了一个困难：有的树苗比较大，而有的位置挨太近，导致两棵树植下去后会撞在一起。
　　他们将树看成一个圆，圆心在他们找的位置上。如果两棵树对应的圆相交，这两棵树就不适合同时植下（相切不受影响），称为两棵树冲突。
　　小明和朋友们决定先合计合计，只将其中的一部分树植下去，保证没有互相冲突的树。他们同时希望这些树所能覆盖的面积和（圆面积和）最大。
输入格式
　　输入的第一行包含一个整数 n ，表示人数，即准备植树的位置数。
　　接下来 n 行，每行三个整数 x, y, r，表示一棵树在空地上的横、纵坐标和半径。
输出格式
　　输出一行包含一个整数，表示在不冲突下可以植树的面积和。由于每棵树的面积都是圆周率的整数倍，请输出答案除以圆周率后的值（应当是一个整数）。
样例输入
6
1 1 2
1 4 2
1 7 2
4 1 2
4 4 2
4 7 2
样例输出
12
评测用例规模与约定
　　对于 30% 的评测用例，1 &lt;= n &lt;= 10；
　　对于 60% 的评测用例，1 &lt;= n &lt;= 20；
　　对于所有评测用例，1 &lt;= n &lt;= 30，0 &lt;= x, y &lt;= 1000，1 &lt;= r &lt;= 1000。
</pre>
</div>
</div>
<div id="outline-container-org8e9de04" class="outline-4">
<h4 id="org8e9de04">解析</h4>
<div class="outline-text-4" id="text-org8e9de04">
<p>
只想出了 <code>dfs</code> 搜索的方法，最高有 30 层，每层最多有两个分支，所以最高会有 <code>2^30</code> 次操作，但大部分都会被剪掉，不知道能不能过全部用例。
</p>

<p>
简单来说就是每次有两种操作，种或者不种，不种是每次都可以选的，种的话就要和之前种下的树检测一下有没有冲突，记录好树的状态并写好回溯就行了。
</p>
</div>
</div>
